wrk2/dome/1024KB/wrk-wlan0-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 208.494ms, rate sampling interval: 475ms
  Thread calibration: mean lat.: 439.004ms, rate sampling interval: 1402ms
  Thread calibration: mean lat.: 514.922ms, rate sampling interval: 1449ms
  Thread calibration: mean lat.: 434.593ms, rate sampling interval: 1287ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   394.25ms  208.95ms   1.08s    58.76%
    Req/Sec    17.40     16.60    52.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  402.43ms
 75.000%  572.41ms
 90.000%  686.08ms
 99.000%  801.79ms
 99.900%  986.62ms
 99.990%    1.09s 
 99.999%    1.09s 
100.000%    1.09s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.151     0.000000            1         1.00
     144.383     0.100000          141         1.11
     188.543     0.200000          281         1.25
     224.895     0.300000          423         1.43
     283.135     0.400000          562         1.67
     402.431     0.500000          702         2.00
     424.959     0.550000          773         2.22
     449.023     0.600000          844         2.50
     474.367     0.650000          913         2.86
     515.327     0.700000          983         3.33
     572.415     0.750000         1053         4.00
     601.599     0.775000         1089         4.44
     624.639     0.800000         1124         5.00
     643.071     0.825000         1160         5.71
     657.407     0.850000         1194         6.67
     671.231     0.875000         1229         8.00
     678.399     0.887500         1247         8.89
     686.079     0.900000         1265        10.00
     695.807     0.912500         1283        11.43
     707.071     0.925000         1299        13.33
     718.847     0.937500         1317        16.00
     722.943     0.943750         1326        17.78
     729.599     0.950000         1335        20.00
     734.719     0.956250         1343        22.86
     739.327     0.962500         1353        26.67
     742.911     0.968750         1361        32.00
     750.591     0.971875         1365        35.56
     754.175     0.975000         1369        40.00
     760.831     0.978125         1374        45.71
     766.463     0.981250         1379        53.33
     776.191     0.984375         1383        64.00
     781.311     0.985938         1385        71.11
     792.575     0.987500         1387        80.00
     801.791     0.989062         1390        91.43
     823.807     0.990625         1391       106.67
     863.743     0.992188         1394       128.00
     869.887     0.992969         1395       142.22
     888.831     0.993750         1396       160.00
     893.439     0.994531         1397       182.86
     894.463     0.995313         1398       213.33
     912.895     0.996094         1399       256.00
     923.647     0.996484         1400       284.44
     923.647     0.996875         1400       320.00
     924.159     0.997266         1401       365.71
     924.159     0.997656         1401       426.67
     932.351     0.998047         1402       512.00
     932.351     0.998242         1402       568.89
     932.351     0.998437         1402       640.00
     986.623     0.998633         1403       731.43
     986.623     0.998828         1403       853.33
     986.623     0.999023         1403      1024.00
     986.623     0.999121         1403      1137.78
     986.623     0.999219         1403      1280.00
    1085.439     0.999316         1404      1462.86
    1085.439     1.000000         1404          inf
#[Mean    =      394.253, StdDeviation   =      208.953]
#[Max     =     1084.416, Total count    =         1404]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2119 requests in 30.13s, 2.10GB read
Requests/sec:     70.33
Transfer/sec:     71.21MB